In [2]:
import pandas as pd
import numpy as np

In [3]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [4]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList,
columns=['Name','Grade','BS','MS','PhD'])
df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

In [5]:
df.describe()

           Grade        BS        MS       PhD
count   5.000000  5.000000  5.000000  5.000000
mean   85.000000  0.600000  0.600000  0.200000
std    11.067972  0.547723  0.894427  0.447214
min    76.000000  0.000000  0.000000  0.000000
25%    77.000000  0.000000  0.000000  0.000000
50%    78.000000  1.000000  0.000000  0.000000
75%    95.000000  1.000000  1.000000  0.000000
max    99.000000  1.000000  2.000000  1.000000

In [6]:
df.var()

Grade    122.5
BS         0.3
MS         0.8
PhD        0.2
dtype: float64